{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 384, 384, 1], "dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "conv_x", "class_name": "Conv2D", "config": {"name": "conv_x", "trainable": false, "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "conv_y", "class_name": "Conv2D", "config": {"name": "conv_y", "trainable": false, "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "Conv_Stacked", "class_name": "Concatenate", "config": {"name": "Conv_Stacked", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv_x", 0, 0, {}], ["conv_y", 0, 0, {}]]]}, {"name": "angles", "class_name": "Lambda", "config": {"name": "angles", "trainable": true, "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAc0AAAAB0AGoBfABkAGQAhQJkAGQAhQJkAGQAhQJkAWYEGQB8\nAGQAZACFAmQAZACFAmQAZACFAmQCZgQZAIMCfQF8AVMAKQNO6QEAAADpAAAAACkC2gJ0ZtoFYXRh\nbjIpAtoMY29udl9zdGFja2Vk2gZhbmdsZXOpAHIHAAAA+h88aXB5dGhvbi1pbnB1dC0yMC0yYTYy\nNWZhMWVkODM+2hBjYWxjdWxhdGVfYW5nbGVzCQAAAHMEAAAAAAE8AQ==\n", null, null], "function_type": "lambda", "output_shape": [384, 384], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["Conv_Stacked", 0, 0, {}]]]}, {"name": "mags1", "class_name": "Lambda", "config": {"name": "mags1", "trainable": true, "function": ["4wEAAAAAAAAAAgAAAAQAAABDAAAAcxIAAAB0AGoBfABkAWQCjQJ9AXwBUwApA07pAwAAACkB2gRh\neGlzKQLaAnRm2gRub3JtKQLaDGNvbnZfc3RhY2tlZNoEbWFnc6kAcgcAAAD6HzxpcHl0aG9uLWlu\ncHV0LTIwLTJhNjI1ZmExZWQ4Mz7aFGNhbGN1bGF0ZV9tYWduaXR1ZGVzAQAAAHMEAAAAAAUOAQ==\n", null, null], "function_type": "lambda", "output_shape": [384, 384], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["Conv_Stacked", 0, 0, {}]]]}, {"name": "sin_cos", "class_name": "Lambda", "config": {"name": "sin_cos", "trainable": true, "function": ["4wEAAAAAAAAABAAAAAQAAABDAAAAcyoAAAB0AGoBfACDAX0BdABqAnwAgwF9AnQAagN8AXwCZwJk\nA2QCjQJ9A3wDUwApBE7pAQAAACkB2gRheGlz6f////8pBNoBS9oDc2lu2gNjb3PaBXN0YWNrKQTa\nBmFuZ2xlc3IFAAAAcgYAAADaB3Npbl9jb3OpAHIKAAAA+h88aXB5dGhvbi1pbnB1dC0yMC0yYTYy\nNWZhMWVkODM+2hFjYWxjdWxhdGVfc2luX2Nvcw0AAABzCAAAAAABCgEKARIB\n", null, null], "function_type": "lambda", "output_shape": [384, 384, 2], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["angles", 0, 0, {}]]]}, {"name": "mags2", "class_name": "Lambda", "config": {"name": "mags2", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxIAAAB0AGoBdAJ0AmYCZANkAo0CUwApBE7pAQAAACkB2gRh\neGlz6f////8pA9oBS9oFc3RhY2vaBG1hZ3MpAdoBeKkAcggAAAD6HzxpcHl0aG9uLWlucHV0LTI0\nLTExZWFmYTQzMzVjZj7aCDxsYW1iZGE+DQAAAHMAAAAA\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["mags1", 0, 0, {}]]]}, {"name": "sin_cos_mag", "class_name": "Multiply", "config": {"name": "sin_cos_mag", "trainable": true}, "inbound_nodes": [[["sin_cos", 0, 0, {}], ["mags2", 0, 0, {}]]]}, {"name": "votes", "class_name": "Conv2D", "config": {"name": "votes", "trainable": false, "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["sin_cos_mag", 0, 0, {}]]]}, {"name": "cells", "class_name": "AveragePooling2D", "config": {"name": "cells", "trainable": true, "pool_size": [8, 8], "padding": "valid", "strides": [8, 8], "data_format": "channels_last"}, "inbound_nodes": [[["votes", 0, 0, {}]]]}, {"name": "cells2", "class_name": "Lambda", "config": {"name": "cells2", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcwwAAAB8AHQAZAETABQAUwApAk7pAgAAACkB2gljZWxsX3Np\nemUpAdoBeKkAcgQAAAD6HzxpcHl0aG9uLWlucHV0LTI0LTExZWFmYTQzMzVjZj7aCDxsYW1iZGE+\nHgAAAHMAAAAA\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["cells", 0, 0, {}]]]}, {"name": "bins1", "class_name": "Lambda", "config": {"name": "bins1", "trainable": false, "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcyAAAAB0AGoBagJ8AHQDZAF0BHQEZAFmBGQCZAONBH0BfAFT\nACkETukBAAAA2gRTQU1FKQLaB3N0cmlkZXPaB3BhZGRpbmcpBdoCdGbaAm5u2hBkZXB0aHdpc2Vf\nY29udjJk2gVmaWx0MdoCYnMpAtoFY2VsbHPaBmNfYmluc6kAcgwAAAD6HzxpcHl0aG9uLWlucHV0\nLTIwLTJhNjI1ZmExZWQ4Mz7aBWJpbnMxEwAAAHMEAAAAAAEcAQ==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["cells2", 0, 0, {}]]]}, {"name": "bins2", "class_name": "Lambda", "config": {"name": "bins2", "trainable": false, "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcyAAAAB0AGoBagJ8AHQDZAF0BHQEZAFmBGQCZAONBH0BfAFT\nACkETukBAAAA2gRTQU1FKQLaB3N0cmlkZXPaB3BhZGRpbmcpBdoCdGbaAm5u2hBkZXB0aHdpc2Vf\nY29udjJk2gVmaWx0MtoCYnMpAtoFY2VsbHPaBmNfYmluc6kAcgwAAAD6HzxpcHl0aG9uLWlucHV0\nLTIwLTJhNjI1ZmExZWQ4Mz7aBWJpbnMyFwAAAHMEAAAAAAEcAQ==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["cells2", 0, 0, {}]]]}, {"name": "bins3", "class_name": "Lambda", "config": {"name": "bins3", "trainable": false, "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcyAAAAB0AGoBagJ8AHQDZAF0BHQEZAFmBGQCZAONBH0BfAFT\nACkETukBAAAA2gRTQU1FKQLaB3N0cmlkZXPaB3BhZGRpbmcpBdoCdGbaAm5u2hBkZXB0aHdpc2Vf\nY29udjJk2gVmaWx0M9oCYnMpAtoFY2VsbHPaBmNfYmluc6kAcgwAAAD6HzxpcHl0aG9uLWlucHV0\nLTIwLTJhNjI1ZmExZWQ4Mz7aBWJpbnMzGwAAAHMEAAAAAAEcAQ==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["cells2", 0, 0, {}]]]}, {"name": "bins4", "class_name": "Lambda", "config": {"name": "bins4", "trainable": false, "function": ["4wEAAAAAAAAAAgAAAAcAAABDAAAAcyAAAAB0AGoBagJ8AHQDZAF0BHQEZAFmBGQCZAONBH0BfAFT\nACkETukBAAAA2gRTQU1FKQLaB3N0cmlkZXPaB3BhZGRpbmcpBdoCdGbaAm5u2hBkZXB0aHdpc2Vf\nY29udjJk2gVmaWx0NNoCYnMpAtoFY2VsbHPaBmNfYmluc6kAcgwAAAD6HzxpcHl0aG9uLWlucHV0\nLTIwLTJhNjI1ZmExZWQ4Mz7aBWJpbnM0HwAAAHMEAAAAAAEcAQ==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["cells2", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["bins1", 0, 0, {}], ["bins2", 0, 0, {}], ["bins3", 0, 0, {}], ["bins4", 0, 0, {}]]]}, {"name": "norm1", "class_name": "Lambda", "config": {"name": "norm1", "trainable": true, "function": ["4wEAAAAAAAAAAgAAAAgAAABDAAAAcywAAAB0AGoBfAB0AGoCdABqA3QAagR8AGQEZAKNAmQDFwCD\nAWQFgwKDAn0BfAFTACkGTukBAAAAKQHaBGF4aXNnOoww4o55RT7p/////3IDAAAAKQXaAnRm2gNk\naXbaC2V4cGFuZF9kaW1z2gRzcXJ02gRub3JtKQLaCmJpbnNfbGF5ZXLaCWJpbnNfbm9ybakAcgsA\nAAD6HzxpcHl0aG9uLWlucHV0LTIwLTJhNjI1ZmExZWQ4Mz7aCGJpbl9ub3JtIwAAAHMEAAAAAAEo\nAQ==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "norm2", "class_name": "Lambda", "config": {"name": "norm2", "trainable": true, "function": ["4wEAAAAAAAAAAwAAAAgAAABDAAAAc1QAAAB0AGoBfAB0AGoCdABqA3QAagR8AGQEZAKNAmQDFwCD\nAWQFgwKDAn0BdABqAXwBdABqAnQAagN0AGoEfAFkBmQCjQJkAxcAgwFkB4MCgwJ9AnwCUwApCE7p\nAQAAACkB2gRheGlzZzqMMOKOeUU+6f////9yAwAAAHIDAAAAcgMAAAApBdoCdGbaA2RpdtoLZXhw\nYW5kX2RpbXPaBHNxcnTaBG5vcm0pA9oKYmluc19sYXllcloJaG9nX25vcm1zWgtob2dfbm9ybXNf\nMqkAcgoAAAD6HzxpcHl0aG9uLWlucHV0LTIwLTJhNjI1ZmExZWQ4Mz7aCGhvZ19ub3JtJwAAAHMG\nAAAAAAEoASgB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["norm1", 0, 0, {}]]]}, {"name": "block1_conv1_", "class_name": "Conv2D", "config": {"name": "block1_conv1_", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["norm2", 0, 0, {}]]]}, {"name": "block1_conv2_", "class_name": "Conv2D", "config": {"name": "block1_conv2_", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1_conv1_", 0, 0, {}]]]}, {"name": "block1_pool_", "class_name": "MaxPooling2D", "config": {"name": "block1_pool_", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block1_conv2_", 0, 0, {}]]]}, {"name": "block2_conv1_", "class_name": "Conv2D", "config": {"name": "block2_conv1_", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block1_pool_", 0, 0, {}]]]}, {"name": "block2_conv2_", "class_name": "Conv2D", "config": {"name": "block2_conv2_", "trainable": true, "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2_conv1_", 0, 0, {}]]]}, {"name": "block2_pool_", "class_name": "MaxPooling2D", "config": {"name": "block2_pool_", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block2_conv2_", 0, 0, {}]]]}, {"name": "block3_conv1_", "class_name": "Conv2D", "config": {"name": "block3_conv1_", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block2_pool_", 0, 0, {}]]]}, {"name": "block3_conv2_", "class_name": "Conv2D", "config": {"name": "block3_conv2_", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3_conv1_", 0, 0, {}]]]}, {"name": "block3_conv3_", "class_name": "Conv2D", "config": {"name": "block3_conv3_", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3_conv2_", 0, 0, {}]]]}, {"name": "block3_conv4_", "class_name": "Conv2D", "config": {"name": "block3_conv4_", "trainable": true, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["block3_conv3_", 0, 0, {}]]]}, {"name": "block3_pool_", "class_name": "MaxPooling2D", "config": {"name": "block3_pool_", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["block3_conv4_", 0, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true}, "inbound_nodes": [[["block3_pool_", 0, 0, {}]]]}, {"name": "fc1", "class_name": "Dense", "config": {"name": "fc1", "trainable": true, "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "fc2", "class_name": "Dense", "config": {"name": "fc2", "trainable": true, "units": 50, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc1", 0, 0, {}]]]}, {"name": "lr", "class_name": "Dense", "config": {"name": "lr", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["fc2", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["lr", 0, 0]]}, "keras_version": "2.1.4", "backend": "tensorflow"}